_posts/algorithms/2015-05-12-project-euler.html
---
layout: post
title: Project Euler
author: zrg
comments: false
description: 欧拉计划是一系列有挑战性的数学与计算机编程题；要解开它们，需要的不止是数学知识：尽管数学能够帮助你找到一些优雅而有效的方法，大多数题目仍需要借助计算机和编程技巧来完成解答。
categories:
- algorithms
tags:
- 欧拉计划
photos:
---

<div id="outline-container-org3632eb8" class="outline-2">
<h2 id="org3632eb8"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
Official Site: https://pe-cn.github.io/
</pre>
</div>
</div>
<div id="outline-container-orgc3da4d2" class="outline-2">
<h2 id="orgc3da4d2"><span class="section-number-2">2</span> 1~100</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org375490b" class="outline-3">
<h3 id="org375490b"><span class="section-number-3">2.1</span> Multiples of 3 and 5</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #727072;">/*</span>
<span style="color: #727072; font-style: italic;">Multiples of 3 and 5</span>
<span style="color: #727072; font-style: italic;">If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.</span>

<span style="color: #727072; font-style: italic;">Find the sum of all the multiples of 3 or 5 below 1000.</span>

<span style="color: #727072; font-style: italic;">3&#30340;&#20493;&#25968;&#21644;5&#30340;&#20493;&#25968;</span>
<span style="color: #727072; font-style: italic;">&#22914;&#26524;&#25105;&#20204;&#21015;&#20986;10&#20197;&#20869;&#25152;&#26377;3&#25110;5&#30340;&#20493;&#25968;&#65292;&#25105;&#20204;&#23558;&#24471;&#21040;3&#12289;5&#12289;6&#21644;9&#65292;&#36825;&#20123;&#25968;&#30340;&#21644;&#26159;23&#12290;</span>

<span style="color: #727072; font-style: italic;">&#27714;1000&#20197;&#20869;&#25152;&#26377;3&#25110;5&#30340;&#20493;&#25968;&#30340;&#21644;&#12290;</span>

<span style="color: #727072;">*/</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">sum</span>=0;
        <span style="color: #ff6188;">for</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>=0;i&lt;1000;i++){
                <span style="color: #ff6188;">if</span>(i%3 == 0 || i%5 == 0){
                        sum+=i; 
                }
        }
        printf(<span style="color: #ffd866;">"1000&#20197;&#20869;&#25152;&#26377;3&#25110;5&#30340;&#20493;&#25968;&#30340;&#21644;&#65306;%d\n"</span>,sum);
        <span style="color: #ff6188;">return</span> 0;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orga32c444" class="outline-3">
<h3 id="orga32c444"><span class="section-number-3">2.2</span> Even Fibonacci numbers</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #727072;">/*</span>
<span style="color: #727072; font-style: italic;"> * Even Fibonacci numbers</span>
<span style="color: #727072; font-style: italic;"> * Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, &#8230;</span>
<span style="color: #727072; font-style: italic;"> * By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#20598;&#26000;&#27874;&#37027;&#22865;&#25968;</span>
<span style="color: #727072; font-style: italic;"> * &#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#20013;&#30340;&#27599;&#19968;&#39033;&#37117;&#26159;&#21069;&#20004;&#39033;&#30340;&#21644;&#12290;&#30001;1&#21644;2&#24320;&#22987;&#29983;&#25104;&#30340;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#21069;10&#39033;&#20026;&#65306;</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, &#8230;</span>
<span style="color: #727072; font-style: italic;"> * &#32771;&#34385;&#35813;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#20013;&#19981;&#36229;&#36807;&#22235;&#30334;&#19975;&#30340;&#39033;&#65292;&#27714;&#20854;&#20013;&#20026;&#20598;&#25968;&#30340;&#39033;&#20043;&#21644;&#12290;</span>
<span style="color: #727072; font-style: italic;"> * </span><span style="color: #727072;">*/</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdlib.h&gt;</span>
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">fun_recursive</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>);
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>;
        printf(<span style="color: #ffd866;">"&#35831;&#36755;&#20837;&#35201;&#36755;&#20986;&#39033;&#65288;&#33258;&#28982;&#25968;&#65289;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#65306;"</span>);
        scanf(<span style="color: #ffd866;">"%d"</span>,&amp;n);
        <span style="color: #78dce8;">int</span> *<span style="color: #fcfcfa;">a</span> = (<span style="color: #78dce8;">int</span> *)malloc((n+1)*<span style="color: #ff6188;">sizeof</span>(<span style="color: #78dce8;">int</span>));<span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#22914;&#38656;&#23384;&#20648;&#65292;&#20351;&#29992;&#21160;&#24577;&#20869;&#23384;&#20998;&#37197;n+1&#20010;&#31354;&#38388;&#36827;&#34892;&#23384;&#20648;</span>
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>,<span style="color: #fcfcfa;">sum</span>=0;
        <span style="color: #ff6188;">for</span>(i=1;i&lt;n+1;i++){
                <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">number</span>=fun_recursive(i);
                printf(<span style="color: #ffd866;">"%d,"</span>,number);
                <span style="color: #ff6188;">if</span>(i!=0 &amp;&amp; i%5==0){
                        printf(<span style="color: #ffd866;">"\n"</span>);
                }
                <span style="color: #ff6188;">if</span>(number%2 == 0){
                        <span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#27714;&#20598;&#25968;&#39033;&#20043;&#21644;</span>
                        sum+=number;
                }
        }
        printf(<span style="color: #ffd866;">"&#20598;&#25968;&#39033;&#20043;&#21644;&#65306;%d\n"</span>,sum);
        <span style="color: #ff6188;">return</span> 0;
}
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">fun_recursive</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>){
        <span style="color: #ff6188;">if</span>(n&lt;=1){
                <span style="color: #ff6188;">return</span> n;
        }<span style="color: #ff6188;">else</span>{
                <span style="color: #ff6188;">return</span> fun_recursive(n-1)+fun_recursive(n-2);
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb663365" class="outline-3">
<h3 id="orgb663365"><span class="section-number-3">2.3</span> Largest prime factor</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #727072;">/* </span><span style="color: #727072; font-style: italic;">Largest prime factor</span>
<span style="color: #727072; font-style: italic;"> * The prime factors of 13195 are 5, 7, 13 and 29.</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * What is the largest prime factor of the number 600851475143 ?</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#26368;&#22823;&#36136;&#22240;&#25968;</span>
<span style="color: #727072; font-style: italic;"> * 13195&#30340;&#25152;&#26377;&#36136;&#22240;&#25968;&#20026;5&#12289;7&#12289;13&#21644;29&#12290;</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * 600851475143&#26368;&#22823;&#30340;&#36136;&#22240;&#25968;&#26159;&#22810;&#23569;&#65311;</span>
<span style="color: #727072; font-style: italic;"> * </span><span style="color: #727072;">*/</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">long</span> <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">n</span>,<span style="color: #fcfcfa;">i</span>;
        printf(<span style="color: #ffd866;">"&#35831;&#36755;&#20837;&#20219;&#24847;&#27491;&#25972;&#25968;&#65306;"</span>);
        scanf(<span style="color: #ffd866;">"%ld"</span>,&amp;n);
        <span style="color: #ff6188;">for</span>(i=2;i&lt;n;i++){
                <span style="color: #ff6188;">while</span>(n!=i){
                        <span style="color: #ff6188;">if</span>(n%i == 0){
                                printf(<span style="color: #ffd866;">"%ld*"</span>,i);
                                n/=i;
                        }<span style="color: #ff6188;">else</span>{
                                <span style="color: #ff6188;">break</span>;
                        }
                }
        }
        printf(<span style="color: #ffd866;">"%ld\n"</span>,n);
        <span style="color: #ff6188;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org909dd96" class="outline-3">
<h3 id="org909dd96"><span class="section-number-3">2.4</span> Largest palindrome product</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-C" id="orga0cb9b8"><span style="color: #727072;">/* </span><span style="color: #727072; font-style: italic;">Largest palindrome product</span>
<span style="color: #727072; font-style: italic;"> * A palindromic number reads the same both ways. The largest palindrome made from the product of two 2-digit numbers is 9009 = 91 &#215; 99.</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * Find the largest palindrome made from the product of two 3-digit numbers.</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#26368;&#22823;&#22238;&#25991;&#20056;&#31215;</span>
<span style="color: #727072; font-style: italic;"> * &#22238;&#25991;&#25968;&#23601;&#26159;&#20174;&#21069;&#24448;&#21518;&#21644;&#20174;&#21518;&#24448;&#21069;&#35835;&#37117;&#19968;&#26679;&#30340;&#25968;&#12290;&#30001;&#20004;&#20010;2&#20301;&#25968;&#30456;&#20056;&#24471;&#21040;&#30340;&#26368;&#22823;&#22238;&#25991;&#20056;&#31215;&#26159; 9009 = 91 &#215; 99&#12290;</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#25214;&#20986;&#30001;&#20004;&#20010;3&#20301;&#25968;&#30456;&#20056;&#24471;&#21040;&#30340;&#26368;&#22823;&#22238;&#25991;&#20056;&#31215;&#12290;</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * </span><span style="color: #727072;">*/</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
<span style="color: #78dce8;">char</span> *<span style="color: #a9dc76;">reverseStr</span>(<span style="color: #78dce8;">char</span> *<span style="color: #fcfcfa;">str</span>,<span style="color: #78dce8;">size_t</span> <span style="color: #fcfcfa;">len</span>)
<span style="color: #78dce8;">int</span> <span style="color: #a9dc76;">main</span>(){
        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">max</span> = 0;
        <span style="color: #ff6188;">for</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">i</span>=100;i&lt;=999;i++){
                <span style="color: #ff6188;">for</span>(<span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">j</span>=100;j&lt;=999;j++){
                        <span style="color: #78dce8;">int</span> <span style="color: #fcfcfa;">palindrome</span> = i*j;
                        <span style="color: #727072;">//</span><span style="color: #727072; font-style: italic;">&#23383;&#31526;&#20018;&#21453;&#36716;</span>
                        *reverseStr()
                }
        }
}
<span style="color: #78dce8;">char</span> *<span style="color: #a9dc76;">reverseStr</span>(<span style="color: #78dce8;">char</span> *<span style="color: #fcfcfa;">str</span>, <span style="color: #78dce8;">size_t</span> <span style="color: #fcfcfa;">len</span>){
        <span style="color: #78dce8;">char</span> *<span style="color: #fcfcfa;">start</span> = str;
        <span style="color: #78dce8;">char</span> *<span style="color: #fcfcfa;">end</span> = str+len-1;
        <span style="color: #78dce8;">char</span> <span style="color: #fcfcfa;">ch</span>;
        <span style="color: #ff6188;">if</span>(str != <span style="color: #ab9df2;">NULL</span>){
                <span style="color: #ff6188;">while</span>(start&lt;end){
                        ch = *start;
                        *start++=*end;
                        *end-- =ch;
                }
        }
        <span style="color: #ff6188;">return</span> str;
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-Python" id="org13f9961"># coding:utf-8
# Largest palindrome product
# A palindromic number reads the same both ways. The largest palindrome made from the product of two 2-digit numbers is 9009 = 91 × 99.
#
# Find the largest palindrome made from the product of two 3-digit numbers.
#
# 最大回文乘积
# 回文数就是从前往后和从后往前读都一样的数。由两个2位数相乘得到的最大回文乘积是 9009 = 91 × 99。
#
# 找出由两个3位数相乘得到的最大回文乘积。
# 
#
# 定义字符反转方法
def reverse(num):
    strnum = str(num)[::-1]
    return int(strnum)
max = None
for a in range(100,1000):
    for b in range(100,1000):
	rs=a*b
	if(rs == reverse(rs) and rs &gt; max):
	    max=rs;
print '由两个3位数相乘得到的最大回文乘积是：',max
</pre>
</div>
</div>
</div>
<div id="outline-container-org015a77d" class="outline-3">
<h3 id="org015a77d"><span class="section-number-3">2.5</span> Smallest multiple</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-C" id="orgb266184"><span style="color: #727072;">/* </span><span style="color: #727072; font-style: italic;">Smallest multiple</span>
<span style="color: #727072; font-style: italic;"> * 2520 is the smallest number that can be divided by each of the numbers from 1 to 10 without any remainder.</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * What is the smallest positive number that is evenly divisible by all of the numbers from 1 to 20?</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#26368;&#23567;&#20493;&#25968;</span>
<span style="color: #727072; font-style: italic;"> * 2520&#26159;&#26368;&#23567;&#30340;&#33021;&#22815;&#34987;1&#21040;10&#25972;&#38500;&#30340;&#25968;&#12290;</span>
<span style="color: #727072; font-style: italic;"> *</span>
<span style="color: #727072; font-style: italic;"> * &#26368;&#23567;&#30340;&#33021;&#22815;&#34987;1&#21040;20&#25972;&#38500;&#30340;&#27491;&#25968;&#26159;&#22810;&#23569;&#65311;</span>
<span style="color: #727072; font-style: italic;"> * </span><span style="color: #727072;">*/</span>
<span style="color: #ab9df2;">#include</span><span style="color: #ffd866;">&lt;stdio.h&gt;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6ba977e" class="outline-2">
<h2 id="org6ba977e"><span class="section-number-2">3</span> 101~200</h2>
</div>
<div id="outline-container-orgd4c5f01" class="outline-2">
<h2 id="orgd4c5f01"><span class="section-number-2">4</span> 201~300</h2>
</div>
<div id="outline-container-org314d4c5" class="outline-2">
<h2 id="org314d4c5"><span class="section-number-2">5</span> 301~400</h2>
</div>
<div id="outline-container-orgf3cec74" class="outline-2">
<h2 id="orgf3cec74"><span class="section-number-2">6</span> 401~500</h2>
</div>
<div id="outline-container-org261d30c" class="outline-2">
<h2 id="org261d30c"><span class="section-number-2">7</span> 501~600</h2>
</div>
<div id="outline-container-org8fa596e" class="outline-2">
<h2 id="org8fa596e"><span class="section-number-2">8</span> 601~now</h2>
</div>
